Revit 2026 API

# NoiseNoisePhase Property

---

The property labeled "Phase" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string NoisePhase { get; }
```
```vb
Public Shared ReadOnly Property NoisePhase As String
	Get
```
```cpp
public:
static property String^ NoisePhase {
	String^ get ();
}
```
```fsharp
static member NoisePhase : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

Noise Class

Autodesk.Revit.DB.Visual Namespace